## Add/Remove Rows and Columns from DataFrames

In [1]:
import pandas as pd

In [2]:
people = {
    "first": ["Eren", "Iron", "Rob"],
    "last": ["yeager", "Man", "Roe"],
    "email": ["erenyeager@gmail.com", "ironman@email.com", "robroe@email.com"]
}

In [4]:

df = pd.DataFrame(people)

In [5]:
df

  first    last                 email
0  Eren  yeager  erenyeager@gmail.com
1  Iron     Man     ironman@email.com
2   Rob     Roe      robroe@email.com

In [6]:
df['first'] + ' ' + df['last']

0    Eren yeager
1       Iron Man
2        Rob Roe
dtype: object

In [7]:
df['full name']=df['first'] + ' ' + df['last']

In [8]:
df

  first    last                 email    full name
0  Eren  yeager  erenyeager@gmail.com  Eren yeager
1  Iron     Man     ironman@email.com     Iron Man
2   Rob     Roe      robroe@email.com      Rob Roe

To delete columns:

In [10]:
df.drop(columns=['last'])

  first                 email    full name
0  Eren  erenyeager@gmail.com  Eren yeager
1  Iron     ironman@email.com     Iron Man
2   Rob      robroe@email.com      Rob Roe

In [11]:
df.drop(columns=['first', 'last'], inplace=True)

In [12]:
df

                  email    full name
0  erenyeager@gmail.com  Eren yeager
1     ironman@email.com     Iron Man
2      robroe@email.com      Rob Roe

In [16]:
df[['first', 'last']] = df['full name'].str.split(' ', expand=True)

In [17]:
df

                  email    full name first    last
0  erenyeager@gmail.com  Eren yeager  Eren  yeager
1     ironman@email.com     Iron Man  Iron     Man
2      robroe@email.com      Rob Roe   Rob     Roe

In [35]:
df.drop(index=1,inplace=True)

In [36]:
df.drop(index=df[df['last'] == 'Roe'].index)

                  email    full name first    last
0  erenyeager@gmail.com  Eren yeager  Eren  yeager